---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\123\OneDrive\桌面\辅修选修\岭院\时间序列\data\../output/extend_svar_results.log
  log type:  text
 opened on:  20 Jan 2026, 19:46:39

. 
. display _newline(2)




. display "================================================================================"
================================================================================

. display "扩展SVAR模型分析结果汇总"
扩展SVAR模型分析结果汇总

. display "================================================================================"
================================================================================

. 
. * 显示VAR估计结果
. estimates restore var_extend_model
(results var_extend_model are active now)

. estimates replay

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Model var_extend_model
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Vector autoregression

Sample: 4 thru 216                              Number of obs     =        213
Log likelihood =  -977.1466                     AIC               =   9.926259
FPE            =   .0140982                     HQIC              =   10.43646
Det(Sigma_ml)  =   .0066423                     SBIC              =   11.18872

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
gdp_yoy              16     .554707   0.9709   7117.243   0.0000
ppi_yoy              16      .61847   0.9841   13202.24   0.0000
pmi_yoy              16     .631874   0.6331    367.529   0.0000
credit               16     1.06359   0.3502   114.8127   0.0000
cpi_national_yoy     16     .468921   0.9352   3076.342   0.0000
----------------------------------------------------------------

----------------------------------------------------------------------------------
                 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
gdp_yoy          |
         gdp_yoy |
             L1. |   1.883065   .0610308    30.85   0.000     1.763446    2.002683
             L2. |  -1.307684   .1076179   -12.15   0.000    -1.518612   -1.096757
             L3. |   .3781316   .0610046     6.20   0.000     .2585648    .4976984
                 |
         ppi_yoy |
             L1. |  -.0814155   .0621062    -1.31   0.190    -.2031413    .0403104
             L2. |   .2130459   .1088594     1.96   0.050    -.0003146    .4264064
             L3. |  -.1352292   .0632495    -2.14   0.033     -.259196   -.0112624
                 |
         pmi_yoy |
             L1. |   .4324004   .0548697     7.88   0.000     .3248578    .5399431
             L2. |  -.6337226     .06535    -9.70   0.000    -.7618063   -.5056388
             L3. |   .3848802   .0627716     6.13   0.000     .2618502    .5079102
                 |
          credit |
             L1. |  -.0018851   .0340208    -0.06   0.956    -.0685646    .0647944
             L2. |  -.0107425   .0334589    -0.32   0.748    -.0763207    .0548358
             L3. |   .0370621   .0337512     1.10   0.272    -.0290891    .1032133
                 |
cpi_national_yoy |
             L1. |   .0893019   .0793098     1.13   0.260    -.0661425    .2447463
             L2. |  -.3483496   .0994609    -3.50   0.000    -.5432893   -.1534098
             L3. |   .2737198   .0741021     3.69   0.000     .1284824    .4189573
                 |
           _cons |   .2801088   .1156329     2.42   0.015     .0534724    .5067452
-----------------+----------------------------------------------------------------
ppi_yoy          |
         gdp_yoy |
             L1. |   .1374183   .0680463     2.02   0.043       .00405    .2707865
             L2. |  -.1333707   .1199885    -1.11   0.266    -.3685438    .1018025
             L3. |   .0292377    .068017     0.43   0.667    -.1040732    .1625487
                 |
         ppi_yoy |
             L1. |   1.758379   .0692452    25.39   0.000     1.622661    1.894097
             L2. |  -1.089949   .1213727    -8.98   0.000    -1.327836   -.8520631
             L3. |    .297532     .07052     4.22   0.000     .1593153    .4357487
                 |
         pmi_yoy |
             L1. |   .2039746    .061177     3.33   0.001       .08407    .3238792
             L2. |  -.0701612    .072862    -0.96   0.336    -.2129681    .0726458
             L3. |   .1381623   .0699872     1.97   0.048       .00099    .2753346
                 |
          credit |
             L1. |   -.007567   .0379315    -0.20   0.842    -.0819113    .0667772
             L2. |     .02172    .037305     0.58   0.560    -.0513964    .0948364
             L3. |  -.0442528   .0376309    -1.18   0.240    -.1180081    .0295024
                 |
cpi_national_yoy |
             L1. |  -.0569955   .0884265    -0.64   0.519    -.2303082    .1163171
             L2. |   .0874854   .1108939     0.79   0.430    -.1298627    .3048335
             L3. |  -.0391705   .0826201    -0.47   0.635     -.201103    .1227619
                 |
           _cons |  -.2116051   .1289249    -1.64   0.101    -.4642933    .0410831
-----------------+----------------------------------------------------------------
pmi_yoy          |
         gdp_yoy |
             L1. |   .4597752    .069521     6.61   0.000     .3235165    .5960339
             L2. |  -.9579338    .122589    -7.81   0.000    -1.198204   -.7176638
             L3. |   .4865455   .0694912     7.00   0.000     .3503453    .6227456
                 |
         ppi_yoy |
             L1. |    .210427    .070746     2.97   0.003     .0717674    .3490866
             L2. |  -.3568505   .1240032    -2.88   0.004    -.5998924   -.1138086
             L3. |   .1202937   .0720484     1.67   0.095    -.0209186    .2615059
                 |
         pmi_yoy |
             L1. |   .4324891   .0625028     6.92   0.000     .3099858    .5549924
             L2. |  -.1365311   .0744411    -1.83   0.067     -.282433    .0093709
             L3. |   .3378213    .071504     4.72   0.000     .1976761    .4779665
                 |
          credit |
             L1. |   .0235154   .0387535     0.61   0.544    -.0524401    .0994709
             L2. |   .0790573   .0381135     2.07   0.038     .0043563    .1537584
             L3. |   .0113524   .0384465     0.30   0.768    -.0640013    .0867061
                 |
cpi_national_yoy |
             L1. |   .0883891   .0903429     0.98   0.328    -.0886798    .2654579
             L2. |   .1072673   .1132973     0.95   0.344    -.1147913    .3293259
             L3. |  -.2668152   .0844107    -3.16   0.002    -.4322572   -.1013732
                 |
           _cons |   .2383532   .1317191     1.81   0.070    -.0198115    .4965179
-----------------+----------------------------------------------------------------
credit           |
         gdp_yoy |
             L1. |    .112406   .1170203     0.96   0.337    -.1169496    .3417616
             L2. |  -.0619353   .2063463    -0.30   0.764    -.4663666    .3424961
             L3. |  -.0125566   .1169701    -0.11   0.915    -.2418137    .2167005
                 |
         ppi_yoy |
             L1. |  -.3831471   .1190822    -3.22   0.001    -.6165439   -.1497502
             L2. |   .5687651   .2087268     2.72   0.006     .1596681     .977862
             L3. |   -.187234   .1212745    -1.54   0.123    -.4249276    .0504597
                 |
         pmi_yoy |
             L1. |  -.2363979   .1052071    -2.25   0.025    -.4425999   -.0301958
             L2. |   .0154928   .1253021     0.12   0.902    -.2300947    .2610803
             L3. |   .0205706   .1203581     0.17   0.864     -.215327    .2564681
                 |
          credit |
             L1. |   .1183166   .0652314     1.81   0.070    -.0095345    .2461678
             L2. |   .0201343    .064154     0.31   0.754    -.1056053    .1458738
             L3. |   .3383717   .0647145     5.23   0.000     .2115335    .4652098
                 |
cpi_national_yoy |
             L1. |  -.2018174   .1520685    -1.33   0.184    -.4998662    .0962314
             L2. |   .1754274   .1907061     0.92   0.358    -.1983497    .5492046
             L3. |   .0432791   .1420832     0.30   0.761    -.2351989    .3217571
                 |
           _cons |  -.2204984   .2217144    -0.99   0.320    -.6550506    .2140539
-----------------+----------------------------------------------------------------
cpi_national_yoy |
         gdp_yoy |
             L1. |   .0244628   .0515923     0.47   0.635    -.0766562    .1255819
             L2. |  -.0140113   .0909747    -0.15   0.878    -.1923184    .1642958
             L3. |     .01899   .0515702     0.37   0.713    -.0820857    .1200656
                 |
         ppi_yoy |
             L1. |   .2497335   .0525014     4.76   0.000     .1468327    .3526343
             L2. |  -.4865406   .0920242    -5.29   0.000    -.6669046   -.3061765
             L3. |   .2431772   .0534679     4.55   0.000     .1383821    .3479724
                 |
         pmi_yoy |
             L1. |   .0765764    .046384     1.65   0.099    -.0143347    .1674874
             L2. |  -.0172946   .0552436    -0.31   0.754      -.12557    .0909809
             L3. |   .0357364   .0530639     0.67   0.501    -.0682669    .1397397
                 |
          credit |
             L1. |   .0284756   .0287594     0.99   0.322    -.0278919     .084843
             L2. |  -.1225037   .0282844    -4.33   0.000    -.1779402   -.0670672
             L3. |  -.0076834   .0285316    -0.27   0.788    -.0636042    .0482375
                 |
cpi_national_yoy |
             L1. |   .8699535   .0670445    12.98   0.000     .7385487    1.001358
             L2. |   .2348563   .0840792     2.79   0.005     .0700641    .3996484
             L3. |  -.1885775   .0626421    -3.01   0.003    -.3113538   -.0658012
                 |
           _cons |  -.0565138   .0977502    -0.58   0.563    -.2481007     .135073
----------------------------------------------------------------------------------

. 
. * 显示SVAR估计结果
. estimates restore svar_extend_model
(results svar_extend_model are active now)

. estimates replay

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Model svar_extend_model
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Structural vector autoregression

 ( 1)  [/A]1_1 = 1
 ( 2)  [/A]1_2 = 0
 ( 3)  [/A]1_3 = 0
 ( 4)  [/A]1_4 = 0
 ( 5)  [/A]1_5 = 0
 ( 6)  [/A]2_2 = 1
 ( 7)  [/A]2_3 = 0
 ( 8)  [/A]2_4 = 0
 ( 9)  [/A]2_5 = 0
 (10)  [/A]3_3 = 1
 (11)  [/A]3_4 = 0
 (12)  [/A]3_5 = 0
 (13)  [/A]4_4 = 1
 (14)  [/A]4_5 = 0
 (15)  [/A]5_5 = 1
 (16)  [/B]1_2 = 0
 (17)  [/B]1_3 = 0
 (18)  [/B]1_4 = 0
 (19)  [/B]1_5 = 0
 (20)  [/B]2_1 = 0
 (21)  [/B]2_3 = 0
 (22)  [/B]2_4 = 0
 (23)  [/B]2_5 = 0
 (24)  [/B]3_1 = 0
 (25)  [/B]3_2 = 0
 (26)  [/B]3_4 = 0
 (27)  [/B]3_5 = 0
 (28)  [/B]4_1 = 0
 (29)  [/B]4_2 = 0
 (30)  [/B]4_3 = 0
 (31)  [/B]4_5 = 0
 (32)  [/B]5_1 = 0
 (33)  [/B]5_2 = 0
 (34)  [/B]5_3 = 0
 (35)  [/B]5_4 = 0

Sample: 4 thru 216                              Number of obs     =        213
Exactly identified model                        Log likelihood    =  -977.1466

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |          1  (constrained)
         2_1 |   .0748751   .0762226     0.98   0.326    -.0745185    .2242687
         3_1 |   .0517267   .0741499     0.70   0.485    -.0936044    .1970578
         4_1 |  -.2191635   .1306862    -1.68   0.094    -.4753038    .0369767
         5_1 |   .1100244   .0571776     1.92   0.054    -.0020417    .2220905
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
         3_2 |  -.3191212   .0665051    -4.80   0.000    -.4494688   -.1887735
         4_2 |  -.0043384   .1232447    -0.04   0.972    -.2458936    .2372167
         5_2 |  -.0807434   .0535695    -1.51   0.132    -.1857377    .0242508
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |          1  (constrained)
         4_3 |   .0979693    .120624     0.81   0.417    -.1384494    .3343881
         5_3 |   .0518474   .0525114     0.99   0.323     -.051073    .1547678
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |          1  (constrained)
         5_4 |    .049585   .0297823     1.66   0.096    -.0087872    .1079572
         1_5 |          0  (constrained)
         2_5 |          0  (constrained)
         3_5 |          0  (constrained)
         4_5 |          0  (constrained)
         5_5 |          1  (constrained)
-------------+----------------------------------------------------------------
/B           |
         1_1 |   .5334659   .0258465    20.64   0.000     .4828077    .5841241
         2_1 |          0  (constrained)
         3_1 |          0  (constrained)
         4_1 |          0  (constrained)
         5_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |   .5934449   .0287525    20.64   0.000      .537091    .6497988
         3_2 |          0  (constrained)
         4_2 |          0  (constrained)
         5_2 |          0  (constrained)
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |   .5760039   .0279075    20.64   0.000     .5213063    .6307016
         4_3 |          0  (constrained)
         5_3 |          0  (constrained)
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |   1.014026   .0491297    20.64   0.000     .9177335    1.110318
         5_4 |          0  (constrained)
         1_5 |          0  (constrained)
         2_5 |          0  (constrained)
         3_5 |          0  (constrained)
         4_5 |          0  (constrained)
         5_5 |   .4407548   .0213546    20.64   0.000     .3989005    .4826092
------------------------------------------------------------------------------

. 
. * 显示格兰杰因果检验结果
. estimates restore var_extend_model
(results var_extend_model are active now)

. vargranger

   Granger causality Wald tests
  +------------------------------------------------------------------+
  |          Equation           Excluded |   chi2     df Prob > chi2 |
  |--------------------------------------+---------------------------|
  |           gdp_yoy            ppi_yoy |  4.5955     3    0.204    |
  |           gdp_yoy            pmi_yoy |  137.89     3    0.000    |
  |           gdp_yoy             credit |  1.2182     3    0.749    |
  |           gdp_yoy   cpi_national_yoy |  15.895     3    0.001    |
  |           gdp_yoy                ALL |  151.37    12    0.000    |
  |--------------------------------------+---------------------------|
  |           ppi_yoy            gdp_yoy |  8.6985     3    0.034    |
  |           ppi_yoy            pmi_yoy |  17.702     3    0.001    |
  |           ppi_yoy             credit |  1.5661     3    0.667    |
  |           ppi_yoy   cpi_national_yoy |  .71354     3    0.870    |
  |           ppi_yoy                ALL |  38.033    12    0.000    |
  |--------------------------------------+---------------------------|
  |           pmi_yoy            gdp_yoy |  65.305     3    0.000    |
  |           pmi_yoy            ppi_yoy |  17.521     3    0.001    |
  |           pmi_yoy             credit |  5.7677     3    0.123    |
  |           pmi_yoy   cpi_national_yoy |  16.704     3    0.001    |
  |           pmi_yoy                ALL |  112.66    12    0.000    |
  |--------------------------------------+---------------------------|
  |            credit            gdp_yoy |  3.6118     3    0.307    |
  |            credit            ppi_yoy |  10.788     3    0.013    |
  |            credit            pmi_yoy |  5.3747     3    0.146    |
  |            credit   cpi_national_yoy |   2.287     3    0.515    |
  |            credit                ALL |  42.455    12    0.000    |
  |--------------------------------------+---------------------------|
  |  cpi_national_yoy            gdp_yoy |  5.5179     3    0.138    |
  |  cpi_national_yoy            ppi_yoy |   28.05     3    0.000    |
  |  cpi_national_yoy            pmi_yoy |  3.7689     3    0.288    |
  |  cpi_national_yoy             credit |  20.104     3    0.000    |
  |  cpi_national_yoy                ALL |  68.495    12    0.000    |
  +------------------------------------------------------------------+

. 
. log close
      name:  <unnamed>
       log:  C:\Users\123\OneDrive\桌面\辅修选修\岭院\时间序列\data\../output/extend_svar_results.log
  log type:  text
 closed on:  20 Jan 2026, 19:46:39
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
