---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\123\OneDrive\桌面\辅修选修\岭院\时间序列\data\../output/svar_results.log
  log type:  text
 opened on:  20 Jan 2026, 18:41:28

. 
. display _newline(2)




. display "================================================================================"
================================================================================

. display "SVAR模型分析结果汇总"
SVAR模型分析结果汇总

. display "================================================================================"
================================================================================

. 
. * 显示VAR估计结果
. estimates restore var_model
(results var_model are active now)

. estimates replay

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Model var_model
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Vector autoregression

Sample: 3 thru 216                              Number of obs     =        214
Log likelihood =  -589.4479                     AIC               =   5.705121
FPE            =    .060299                     HQIC              =   5.838594
Det(Sigma_ml)  =   .0495501                     SBIC              =   6.035427

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
cpi_national_yoy      7      .50832   0.9245   2622.016   0.0000
ppi_yoy               7     .656796   0.9814   11286.91   0.0000
gdp_yoy               7     .715917   0.9496    4035.56   0.0000
----------------------------------------------------------------

----------------------------------------------------------------------------------
                 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
cpi_national_yoy |
cpi_national_yoy |
             L1. |   .8336193    .067158    12.41   0.000      .701992    .9652466
             L2. |   .0883171   .0659166     1.34   0.180     -.040877    .2175112
                 |
         ppi_yoy |
             L1. |   .1792414    .037609     4.77   0.000     .1055291    .2529537
             L2. |  -.1764947   .0372721    -4.74   0.000    -.2495467   -.1034427
                 |
         gdp_yoy |
             L1. |   .0260842   .0380187     0.69   0.493    -.0484311    .1005996
             L2. |  -.0065806   .0384257    -0.17   0.864    -.0818936    .0687325
                 |
           _cons |  -.0132193   .0997633    -0.13   0.895    -.2087518    .1823132
-----------------+----------------------------------------------------------------
ppi_yoy          |
cpi_national_yoy |
             L1. |  -.0100614   .0867742    -0.12   0.908    -.1801358    .1600129
             L2. |  -.0017916   .0851701    -0.02   0.983     -.168722    .1651388
                 |
         ppi_yoy |
             L1. |   1.672473   .0485942    34.42   0.000      1.57723    1.767716
             L2. |  -.7154606   .0481589   -14.86   0.000    -.8098504   -.6210709
                 |
         gdp_yoy |
             L1. |   .1610087   .0491236     3.28   0.001     .0647281    .2572892
             L2. |  -.1343646   .0496495    -2.71   0.007    -.2316758   -.0370533
                 |
           _cons |  -.1405339   .1289032    -1.09   0.276    -.3931794    .1121117
-----------------+----------------------------------------------------------------
gdp_yoy          |
cpi_national_yoy |
             L1. |   .0001957   .0945851     0.00   0.998    -.1851878    .1855791
             L2. |   -.008215   .0928367    -0.09   0.929    -.1901715    .1737415
                 |
         ppi_yoy |
             L1. |   .0259312   .0529684     0.49   0.624    -.0778849    .1297474
             L2. |  -.0184185   .0524939    -0.35   0.726    -.1213046    .0844676
                 |
         gdp_yoy |
             L1. |   1.569323   .0535454    29.31   0.000     1.464376     1.67427
             L2. |  -.6493205   .0541187   -12.00   0.000    -.7553911   -.5432498
                 |
           _cons |   .5695336   .1405063     4.05   0.000     .2941464    .8449209
----------------------------------------------------------------------------------

. 
. * 显示SVAR估计结果
. estimates restore svar_model
(results svar_model are active now)

. estimates replay

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Model svar_model
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Structural vector autoregression

 ( 1)  [/A]1_1 = 1
 ( 2)  [/A]1_2 = 0
 ( 3)  [/A]1_3 = 0
 ( 4)  [/A]2_2 = 1
 ( 5)  [/A]2_3 = 0
 ( 6)  [/A]3_3 = 1
 ( 7)  [/B]1_2 = 0
 ( 8)  [/B]1_3 = 0
 ( 9)  [/B]2_1 = 0
 (10)  [/B]2_3 = 0
 (11)  [/B]3_1 = 0
 (12)  [/B]3_2 = 0

Sample: 3 thru 216                              Number of obs     =        214
Exactly identified model                        Log likelihood    =  -589.4479

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |          1  (constrained)
         2_1 |  -.0287108   .0626828    -0.46   0.647    -.1515668    .0941452
         3_1 |   .0724408    .047561     1.52   0.128     -.020777    .1656586
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
         3_2 |  -.1372662   .0518421    -2.65   0.008    -.2388749   -.0356575
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |          1  (constrained)
-------------+----------------------------------------------------------------
/B           |
         1_1 |   .7041103   .0340345    20.69   0.000      .637404    .7708167
         2_1 |          0  (constrained)
         3_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |   .6456481   .0312086    20.69   0.000     .5844804    .7068157
         3_2 |          0  (constrained)
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |   .4896497   .0236681    20.69   0.000     .4432611    .5360384
------------------------------------------------------------------------------

. 
. * 显示格兰杰因果检验结果
. vargranger

   Granger causality Wald tests
  +------------------------------------------------------------------+
  |          Equation           Excluded |   chi2     df Prob > chi2 |
  |--------------------------------------+---------------------------|
  |           gdp_yoy            ppi_yoy |  .50388     2    0.777    |
  |           gdp_yoy   cpi_national_yoy |  .07272     2    0.964    |
  |           gdp_yoy                ALL |  .55035     4    0.968    |
  |--------------------------------------+---------------------------|
  |           ppi_yoy            gdp_yoy |  12.222     2    0.002    |
  |           ppi_yoy   cpi_national_yoy |  .17972     2    0.914    |
  |           ppi_yoy                ALL |  12.827     4    0.012    |
  |--------------------------------------+---------------------------|
  |  cpi_national_yoy            gdp_yoy |  2.6423     2    0.267    |
  |  cpi_national_yoy            ppi_yoy |  22.923     2    0.000    |
  |  cpi_national_yoy                ALL |  32.043     4    0.000    |
  +------------------------------------------------------------------+

. 
. log close
      name:  <unnamed>
       log:  C:\Users\123\OneDrive\桌面\辅修选修\岭院\时间序列\data\../output/svar_results.log
  log type:  text
 closed on:  20 Jan 2026, 18:41:28
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
